AdvancedtutimplementationBC/run/002-3D-Pipe/case1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    INLET
    {
        type            patch;
        nFaces          1440;
        startFace       101088;
    }
    OUTLET
    {
        type            patch;
        nFaces          1440;
        startFace       102528;
    }
    WALL
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2304;
        startFace       103968;
    }
)

// ************************************************************************* //
